#include <stdio.h>

int main(void)
{
    char p[9]={'d','o','n','t','o','u','c','h','M'};
    char q[9]; //to save the output array
    int n,i=0;
    scanf("%d",&n);

    if(n>0)
    {
        for(i=0;i<n;i++){ //做i（ｎ)次向右換位
            q[0]= p[8];
            q[1]= p[0];
            q[2]= p[1];
            q[3]= p[2];
            q[4]= p[3];

            q[5]= p[4];
            q[6]= p[5];
            q[7]= p[6];
            q[8]= p[7]; //換到q
            
            p[0]= q[0];
            p[1]= q[1];
            p[2]= q[2];
            p[3]= q[3];
            p[4]= q[4];

            p[5]= q[5];
            p[6]= q[6];
            p[7]= q[7];
            p[8]= q[8]; //再換回p
        }
    }
    
    else if(n<0)
    {
        for(i=0;i>n;i--){ ////做i（ｎ)次向左換位
            q[0]= p[1];
            q[1]= p[2];
            q[2]= p[3];
            q[3]= p[4];
            q[4]= p[5];

            q[5]= p[6];
            q[6]= p[7];
            q[7]= p[8];
            q[8]= p[0];
            
            p[0]= q[0];
            p[1]= q[1];
            p[2]= q[2];
            p[3]= q[3];
            p[4]= q[4];

            p[5]= q[5];
            p[6]= q[6];
            p[7]= q[7];
            p[8]= q[8];
        }
    }
    else //和原來相等
    {
        p[0]= p[0];
        p[1]= p[1];
        p[2]= p[2];
        p[3]= p[3];
        p[4]= p[4];

        p[5]= p[5];
        p[6]= p[6];
        p[7]= p[7];
        p[8]= p[8];
    }

    char r[3][3]; //做3*3陣列
    int j;
    i = 0,j = 0;
    int x=0;
    while(x <=8) //總共做8次
    {
        while (j<=2)
        {
            i=0;
            while (i<=2)
            {
                r[i][j]=p[x];
                i++;
                x++;
            }
            j++;
        }
    }

    printf("%c%c%c%c%c%c%c%c%c\n",r[0][0],r[0][1],r[0][2],r[1][0],r[1][1],r[1][2],r[2][0],r[2][1],r[2][2]);
    return 0;
}
